In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
from numpy.random import randn

In [3]:
ser = Series(randn(6), index = [[1, 1, 1, 2, 2, 2], ['A', 'B', 'C', 'A', 'B', 'C']])
ser

1  A   -0.223049
   B   -1.601967
   C    1.796508
2  A    1.040692
   B   -0.946885
   C   -1.128358
dtype: float64

In [4]:
ser.index

MultiIndex([(1, 'A'),
            (1, 'B'),
            (1, 'C'),
            (2, 'A'),
            (2, 'B'),
            (2, 'C')],
           )

In [5]:
ser[1]

A   -0.223049
B   -1.601967
C    1.796508
dtype: float64

In [6]:
ser[2]

A    1.040692
B   -0.946885
C   -1.128358
dtype: float64

In [9]:
ser[:, 'A']

1   -0.223049
2    1.040692
dtype: float64

In [10]:
df = ser.unstack()

In [11]:
df

          A         B         C
1 -0.223049 -1.601967  1.796508
2  1.040692 -0.946885 -1.128358

In [14]:
df2 = DataFrame(np.arange(16).reshape((4, 4)), index = [['A', 'B', 'A', 'B'], [1, 2, 1, 2]], columns = [['NY', 'NY', 'LA', 'SF'], ['cold', 'hot', 'hot', 'cold']])

In [15]:
df2

      NY      LA   SF
    cold hot hot cold
A 1    0   1   2    3
B 2    4   5   6    7
A 1    8   9  10   11
B 2   12  13  14   15

In [16]:
df2.index.names = ['INDEX_1', 'INDEX_2']
df2.columns.names = ['city', 'temp']
df2

city              NY      LA   SF
temp            cold hot hot cold
INDEX_1 INDEX_2
A       1          0   1   2    3
B       2          4   5   6    7
A       1          8   9  10   11
B       2         12  13  14   15

In [17]:
df2.swaplevel('city', 'temp', axis = 1)

temp            cold hot     cold
city              NY  NY  LA   SF
INDEX_1 INDEX_2
A       1          0   1   2    3
B       2          4   5   6    7
A       1          8   9  10   11
B       2         12  13  14   15

In [19]:
df2.sort_index(1)

/tmp/ipykernel_34472/601311152.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.sort_index will be keyword-only
  df2.sort_index(1)

city             LA   NY       SF
temp            hot cold hot cold
INDEX_1 INDEX_2
A       1         2    0   1    3
B       2         6    4   5    7
A       1        10    8   9   11
B       2        14   12  13   15

In [21]:
df2.sum(level = 'temp', axis = 1)

/tmp/ipykernel_34472/1784703533.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  df2.sum(level = 'temp', axis = 1)

temp             cold  hot
INDEX_1 INDEX_2
A       1           3    3
B       2          11   11
A       1          19   19
B       2          27   27